
from ShahmMusic import BOT_NAME

PM_START_TEXT = """**
◈ اهلين عمري في بوت ميوزك العرب ♪

- وظيفتي تشغيل الوسائط والاغاني في المكالمات الجماعية الخاصة بالمجوعات 

- اضغط على زر الاوامر عشان تشوف الاوامر وطريقة التفعيل مطور السورس : @ggqgg **
"""

START_TEXT = """
**- [SOURCE Arabs](t.me/V_G_G)
—————————————
- [𝙗𝙤𝙩 𝙘𝙝𝙖𝙩 𝙢𝙚𝙧𝙤 ](t.me/STXARBOT)

- [Source developer](t.me/ggqgg)**
"""

HELP_TEXT = f"""
<u> **الاوامر في بوت ميوزك {BOT_NAME} :**</u>

**♚ مرحبا بك في اوامر التشغيل ♡**

**• اوامر التشغيل البـوت**

**›› تشغيل ↫ لتشغيل اغنية**
**›› تخطي ↫ لتخطي التشغيل الحالي**
**›› ايقاف ↫ لانتهاء التشغيل الحالي**
**›› اسكت ↫ لايقاف التشغيل الحالي مؤقتا**
**›› كمل ↫ لاستمرار التشغيل المتوقف**
**›› بحث او فيديو ↫لتحميـل الاغانـي اڪتب**

**›› اكتب بنك لمعرفة سرعة تشغيل البوت **
**›› اكتب المطورين لمعرفة مطورين البوت**
**›› اكتب تحميل + الاسم للتنزيل من اليوتيوب**

قناة السورس : @V_G_G
مطور السورس : @GGQGG
"""

HELP_SUDO = f"""
<u> **اوامر المطور {BOT_NAME} :**</u>

**›› اكتب المكالمات لمعرفة المكالمات في البوت**
**›› اكتب /eval لتشغيل على محطة البوت **
**›› اكتب فحص لاختبار سرعة السيرفر  **
**›› اكتب الاحصائيات لعرض إحصائيات السيرفر **

**›› اكتب اسم + الاسم لوضعة اسم للمساعد**
**›› اكتب بايو + البايو لوضعة بايو للمساعد**
**›› اكتب صورة واعمل رد على صورة للمساعد**
**›› اكتب مسح لحذف صورة الحساب المساعد **

قناة السورس : @V_G_G
"""

HELP_DEV = f"""
<u> **اوامر المالك {BOT_NAME} :**</u>

**›› هذا الاوامر فقط لمطور البوت **

**›› اكتب اذاعة و اعمل رد على الاذاعه**
**›› اكتب تنظيف لمسح التخزين المؤقت للبوت**
**›› اكتب مغادرة لمغادرة المساعد الكروبات**

**›› اكتب مطور +اليوزر لإضافة مطور في البوت**
**›› اكتب تنزيل +اليوزر لـتـنزيل مطور من البوت**

قناة السورس : @V_G_G
"""
